In [1]:
import pandas as pd

Данные для проверки:

count_top3([1880]) == ['John', 'William', 'Mary']

count_top3([1900, 1950, 2000]) == ['James', 'John', 'Robert']

In [ ]:
def count_top3(years):
    # ПУстой датафрейм, куда мы будем помещать ТОП3 из каждого требуемого года:
    names_data = pd.DataFrame({
        'Name':[],
        'Gender':[],
        'Count':[]
    })
    
    # Проходимся списку лет, которые передаются функции и помещаем данные из них в общий датафрейм:
    for year in years:
        df = pd.read_csv(f'names/yob{year}.txt', names = ['Name', 'Gender', 'Count'])
        names_data = pd.concat([names_data, df])
        
    top_names = names_data.groupby(['Name']).sum().sort_values('Count', ascending=False)

    return top_names.head(3)

In [108]:
count_top3([1880])

          Count
Name
John     9701.0
William  9562.0
Mary     7092.0

In [107]:
count_top3([1900, 1950, 2000])

           Count
Name
James   111789.0
John    109601.0
Robert  101368.0